{
    "publications": [
        "1",
        "Lämsä, J., de Mooij, S., Aksela, O., Athavale, S., Bistolfi, I., Azevedo, R., Bannert, M., Gasevic, D., Molenaar, I., & Järvelä, S. (2025). Measuring secondary education students' self-regulated learning processes with digital trace data. Learning and Individual Differences, 118, 102625. https://doi.org/10.1016/j.lindif.2024.102625",
        "de Mooij, S., Lämsä, J., Lim, L., Aksela, O., Athavale, S., Bistolfi, I., ... & Molenaar, I. (2025). A Systematic Review of Self-Regulated Learning through Integration of Multimodal Data and Artificial Intelligence. Educational Psychology Review, 37(2), 1-27. https://doi.org/10.1007/s10648-025-10028-0",
        "Jin, F. J. Y., Nath, D., Guan, R., Li, T., Li, X., Mello, R. F., ... & Tsai, Y. S. (2025). Analytics of Self‐Regulated Learning in Learning Analytics Feedback Processes: Associations With Feedback Literacy in Secondary Education. Journal of Computer Assisted Learning, 41(4), e70076. https://doi.org/10.1111/jcal.70076",
        "Li, T., Yan, L., Iqbal, S., Srivastava, N., Singh, S., Raković, M., ... & Li, X. (2025). Analytics of self-regulated learning strategies and scaffolding: Associations with learning performance. Computers and Education: Artificial Intelligence, 100410. https://doi.org/10.1016/j.caeai.2025.100410",
        "Guan, R., Raković, M., Chen, G. et al. How educational chatbots support self-regulated learning? A systematic review of the literature.  Education and Information Technologies 30, 4493–4518 (2025). https://doi.org/10.1007/s10639-024-12881-y",
        "Fan, Y., Tang, L., Le, H., Shen, K., Tan, S., Zhao, Y., Shen, Y., Li, X., & Gašević, D. (2025). Beware of metacognitive laziness: Effects of generative artificial intelligence on learning motivation, processes, and performance. British Journal of Educational Technology, 56, 489–530. https://doi.org/10.1111/bjet.13544",
        "Yan, L., Greiff, S., Teuber, Z. et al. Promises and challenges of generative artificial intelligence for human learning. Nat Hum Behav 8, 1839–1850 (2024). https://doi.org/10.1038/s41562-024-02004-5",
        "Yan, L., Sha, L., Zhao, L., Li, Y., Martinez-Maldonado, R., Chen, G., Li, X., Jin, Y., & Gašević, D. (2024). Practical and ethical challenges of large language models in education: A systematic scoping review. British Journal of Educational Technology, 55, 90–112. https://doi.org/10.1111/bjet.13370",
        "Riordan Alfredo, Vanessa Echeverria, Yueqiao Jin, Lixiang Yan, Zachari Swiecki, Dragan Gašević, Roberto Martinez-Maldonado, Human-centred learning analytics and AI in education: A systematic literature review, Computers and Education: Artificial Intelligence, Volume 6, 2024, 100215, ISSN 2666-920X, https://doi.org/10.1016/j.caeai.2024.100215.",
        "Aksela, O., Lämsä, J., & Järvelä, S. (2024). Secondary School Students’ Enacted Self-Regulated Learning Strategies in a Computer-Based Writing Task–Insights from Digital Trace Data and Interviews. Technology, Knowledge and Learning, 1-30. https://doi.org/10.1007/s10758-024-09789-4",
        "Giannakos, M., Azevedo, R., Brusilovsky, P., Cukurova, M., Dimitriadis, Y., Hernandez-Leo, D., … Rienties, B. (2024). The promise and challenges of generative AI in education. Behaviour & Information Technology, 1–27. https://doi.org/10.1080/0144929X.2024.2394886",
        "Järvelä, S., & Hadwin, A. (2024). Triggers for self-regulated learning: A conceptual framework for advancing multimodal research about SRL. Learning and Individual Differences, 115, 102526. https://doi.org/10.1016/J.LINDIF.2024.102526",
        "Molenaar, I., de Mooij, S., Azevedo, R., Bannert, M., Järvelä, S., & Gasevic, D. (2023). Measuring self-regulated learning and the role of AI: Five years of research using multimodal multichannel data. Computers in Human Behavior, 139 (2023), 107540. https://doi:10.1016/j.chb.2022.107540",
        "Li, Y., Raković, M., Dai, W., Lin, J., Khosravi, H., Galbraith, K., ... & Chen, G. (2023). Are deeper reflectors better goal-setters? AI-empowered analytics of reflective writing in pharmaceutical education. Computers and Education: Artificial Intelligence, 5, 100157. https://doi.org/10.1016/j.caeai.2023.100157",
        "Gašević, D., Siemens, G., & Sadiq, S. (2023). Empowering learners for the age of artificial intelligence. Computers and Education: Artificial Intelligence, 4, 100130. https://doi.org/10.1016/j.caeai.2023.100130",
        "Raković, M., Matcha, W., Eagan, B., Jovanović, J., Shaffer, D. W., Pardo, A., & Gašević, D. (2023). Network analytics to unveil links of learning strategies, time management, and academic performance in a flipped classroom. Journal of Learning Analytics, 10(3), 64-86. https://doi.org/10.18608/jla.2023.7843",
        "Raković, M., Gašević, D., Hassan, S. U., Ruipérez Valiente, J. A., Aljohani, N., & Milligan, S. (2023). Learning analytics and assessment: Emerging research trends, promises and future opportunities. British Journal of Educational Technology, 54(1), 10-18. https://doi.org/10.1111/bjet.13301",
        "Osakwe, I., Chen, G., Fan, Y., Rakovic, M., Li, X., Singh, S., ... & Gašević, D. (2023). Reinforcement learning for automatic detection of effective strategies for self-regulated learning. Computers and Education: Artificial Intelligence, 5, 100181. https://doi.org/10.1016/j.caeai.2023.100181",
        "Gašević, D., Greiff, S., & Shaffer, D. W. (2022). Towards strengthening links between learning analytics and assessment: Challenges and potentials of a promising new bond. Computers in Human Behavior, 134, 107304. https://doi.org/10.1016/j.chb.2022.107304",
        "Khosravi, H., Shum, S. B., Chen, G., Conati, C., Tsai, Y. S., Kay, J., ... & Gašević, D. (2022). Explainable artificial intelligence in education. Computers and Education: Artificial Intelligence, 3, 100074. https://doi.org/10.1016/j.caeai.2022.100074"
    ],
    "conferences": [
        "Lämsä, J., & Järvelä, S. (2025). Students’ enactment of self-regulated learning: How does prior knowledge contribute to learning traces?  In Rajala, A., Cortez, A., Hofmann, H., Jornet, A., Lotz-Sisitka, H., & Markauskaite, L. (Eds.), Proceedings of the 19th International Conference of the Learning Sciences - ICLS 2025, 2668—2670. International Society of the Learning Sciences. https://doi.org/10.22318/icls2025.104120",
        "Zhao, L., Raković, M., B. Cloude, E., Li, X., Gašević, D., & Bardach, L. (2025, March). The Effect of Sequential Transition of Self-Regulated Learning Processes on Performance: Insights from Ordered Network Analysis. In Proceedings of the 15th International Learning Analytics and Knowledge Conference (pp. 516-526). https://doi.org/10.1145/3706468.3706534",
        "Cheng, Y., Guan, R., Li, T., Raković, M., Li, X., Fan, Y., ... & Swiecki, Z. (2025, March). Self-regulated learning processes in secondary education: A network analysis of trace-based measures. In Proceedings of the 15th International Learning Analytics and Knowledge Conference (pp. 260-271). https://doi.org/10.1145/3706468.3706502",
        "Li, T., Nath, D., Cheng, Y., Fan, Y., Li, X., Raković, M., ... & Gašević, D. (2025, March). Turning real-time analytics into adaptive scaffolds for self-regulated learning using generative artificial intelligence. In Proceedings of the 15th International Learning Analytics and Knowledge Conference (pp. 667-679). https://doi.org/10.1145/3706468.3706559",
        "Yang, K., Raković, M., Liang, Z., Yan, L., Zeng, Z., Fan, Y., ... & Chen, G. (2025, March). Modifying AI, enhancing essays: How active engagement with generative AI boosts writing quality. In Proceedings of the 15th International Learning Analytics and Knowledge Conference (pp. 568-578). https://doi.org/10.1145/3706468.3706544",
        "Alghamdi, S. R., Raković, M., Yang, K., Fan, Y., Gašević, D., & Chen, G. (2025, March). Analytics of Temporal Patterns of Self-regulated Learners: A Time Series Approach. In Proceedings of the 15th International Learning Analytics and Knowledge Conference (pp. 283-292). https://doi.org/10.1145/3706468.3706504",
        "Yan, L., Gasevic, D., Echeverria, V., Jin, Y., Zhao, L., & Martinez-Maldonado, R. (2025, March). From Complexity to Parsimony: Integrating Latent Class Analysis to Uncover Multimodal Learning Patterns in Collaborative Learning. In Proceedings of the 15th International Learning Analytics and Knowledge Conference (pp. 70-81). https://doi.org/10.1145/3706468.3706476",
        "Li, T., Fan, Y., Srivastava, N., Zeng, Z., Li, X., Khosravi, H., ... & Gašević, D. (2024). Analytics of Planning Behaviours in Self-Regulated Learning: Links with Strategy Use and Prior Knowledge. In Proceedings of the 14th Learning Analytics and Knowledge Conference (pp. 438-449). https://doi.org/10.1145/3636555.3636900",
        "Raković, M., Li, Y., Foumani, N. M., Salehi, M., Kuhlmann, L., Mackellar, G., ... & Gašević, D. (2024). Measuring Affective and Motivational States as Conditions for Cognitive and Metacognitive Processing in Self-Regulated Learning. In Proceedings of the 14th Learning Analytics and Knowledge Conference (pp. 701-712). https://doi.org/10.1145/3636555.3636934",
        "Nath, D., Gasevic, D., Fan, Y., & Rajendran, R. (2024). CTAM4SRL: A Consolidated Temporal Analytic Method for Analysis of Self-Regulated Learning. In Proceedings of the 14th Learning Analytics and Knowledge Conference (pp. 645-655). https://doi.org/10.1145/3636555.3636926",
        "Osakwe, I., Chen, G., Fan, Y., Rakovic, M., Singh, S., Molenaar, I., & Gašević, D. (2024). Measurement of Self-regulated Learning: Strategies for mapping trace data to learning processes and downstream analysis implications. In Proceedings of the 14th Learning Analytics and Knowledge Conference (pp. 563-575). http://dx.doi.org/10.1145/3636555.3636915",
        "Saint, J., Fan, Y., & Gasevic, D. (2024). Analytics of scaffold compliance for self-regulated learning. In Proceedings of the 14th Learning Analytics and Knowledge Conference (pp. 326-337). https://doi.org/10.1145/3636555.3636887",
        "Cheng, Y., Lyons, K., Chen, G., Gašević, D., & Swiecki, Z. (2024, March). Evidence-centered Assessment for Writing with Generative AI. In Proceedings of the 14th Learning Analytics and Knowledge Conference (pp. 178-188). https://doi.org/10.1145/3636555.3636866",
        "Iqbal, S., Rakovic, M., Chen, G., Li, T., Bajaj, J., Mello, R. F., ... & Gasevic, D. (2024, March). Towards Improving Rhetorical Categories Classification and Unveiling Sequential Patterns in Students' Writing. In Proceedings of the 14th Learning Analytics and Knowledge Conference (pp. 656-666). https://doi.org/10.1145/3636555.3636927",
        "Iqbal, S., Rakovic, M., Chen, G., Li, T., Ferreira Mello, R., Fan, Y., ... & Gasevic, D. (2023). Towards automated analysis of rhetorical categories in students essay writings using Bloom’s taxonomy. In Proceedings of the 13th International Learning Analytics and Knowledge Conference (pp. 418-429). https://doi.org/10.1145/3576050.3576112",
        "Yan, L., Martinez-Maldonado, R., & Gasevic, D. (2024). Generative artificial intelligence in learning analytics: Contextualising opportunities and challenges through the learning analytics cycle. In Proceedings of the 14th Learning Analytics and Knowledge Conference (pp. 101-111). https://doi.org/10.1145/3636555.3636856"
    ],
    "conferencePresentations": [
        "Molenaar, I., de Mooij, S., Azevedo, R., Bannert, M., Järvelä, S., & Gasevic, D. (2023, August). Research on the grid: Measuring self-regulated learning with multimodal data and the role of AI. In S. Järvelä (Chair), Advancing SRL research with Artificial Intelligence - theoretical and conceptual foundations. Symposium presented at the 20th Biennial EARLI Conference for Research on Learning and Instruction, Thessaloniki, Greece, August 22-26, 2023.",
        "Lämsä, J., de Mooij, S., Lim, L., Dever, D., Wiedbusch, M., Azevedo, R., Bannert, M., Gašević, D., Molenaar, I., & Järvelä, S. (2024, March). CELLA@LAK24 workshop: Supporting Students’ Self-Regulated Learning Through Human-AI Collaboration. Workshop at the 14th International Learning Analytics and Knowledge Conference, Kyoto, Japan, March 18-22, 2024.",
        "De Mooij., S., Lämsä, J., Azevedo, R., Bannert., M., Gasevic, D., Järvelä, S., & Molenaar, I. (2024, March). A Systematic Review of Self-Regulated Learning Through Multimodal Data and Machine Learning Integration - Insights from the Grid. Poster presented at the 14th International Learning Analytics and Knowledge Conference, Kyoto, Japan, March 18-22, 2024.",
        "Athavale, S., Lim, L., & Bannert, M. (2024). Training secondary school students’ SRL before learning with AI-based online learning environments. In Lämsä, J., & Raković, M. (Chairs), Promoting self-regulated learning of secondary school students using trace data and AI. Symposium presented at the 11th International Conference of EARLI SIG16 Metacognition and Self-Regulated Learning for Research on Learning and Instruction, Heidelberg, Germany, September 11-13, 2024.",
        "Azevedo, R., Molenaar, I., Bannert, M., Järvelä, S. & Gasevic, D. (Organizers & Chairs). Advancing Self-Regulated Learning through Generative AI with Advanced Learning Technologies. Symposium presented at the 11th International Conference of EARLI SIG16 Metacognition and Self-Regulated Learning, Heidelberg, Germany, September 11-13, 2024.",
        "Bistolfi, I., de Mooij, S., van der Graaf, J., & Molenaar, I. (2023, August). Measuring Self-regulated learning (SRL) in essay writing. Poster presented at the 20th Biennial EARLI Conference for Research on Learning and Instruction, Thessaloniki, Greece, August 22-26, 2023.",
        "Bistolfi, I., de Mooij, S., van der Graaf, J., & Molenaar, I. (2024). Beyond words: measuring SRL using students’ written data. In Lim, L., & van der Graaf, J. (Chairs), Bridging Research and Practice: Fine-Grained Insights of students’ SRL in Tech-Enhanced Learning. Symposium presented at the International Conference of EARLI SIG16 Metacognition and Self-Regulated Learning for Research on Learning and Instruction, Heidelberg, Germany, September 11-13, 2024.",
        "Bistolfi, I., de Mooij, S., van der Graaf, J., & Molenaar, I. (2024). Exploring Real-Time Automated Self-Regulated Learning Detection in Essay Texts. In JURE invited symposium at the 11th International Conference of EARLI SIG27 Online Measures of Learning Processes, Trondheim, Norway, November 25-27, 2024.",
        "Jin, F., Li, T., Raković, M., Qian, K., Nath, D., Cheng, Y., Guan, R., Li, X., Tsai, Y.-S., Swiecki, Z., & Gašević, D (2024). Using trace data to inform the design of AI-based adaptive scaffolding for self-regulated learning. In 11th International Biennial Conference of EARLI SIG 16 (Metacognition and Self-regulated Learning).",
        "Athavale, S., Lim, L., & Bannert, M. (2025, August). Training secondary school students’ SRL before learning with an AI-based online learning environment. In S. de Mooij & J. Lämsä (Chairs), Beyond learning traces: Advancing self-regulated learning with AI – From measurement to support. Symposium presented at the 21st Biennial Conference of the European Association for Research on Learning and Instruction (EARLI 2025), Graz, Austria, August 25-29, 2025.",
        "de Mooij, S., Lämsä, J., Lim, L., Aksela, O., Athavale, S., Bistolfi, I., Jin, F., Li, T., Azevedo, R., Bannert, M., Gašević, D., Järvelä, S., & Molenaar, I. (2025, August). A systematic review of SRL: Integrating multimodal data and artificial intelligence. In S. de Mooij & J. Lämsä (Chairs), Beyond learning traces: Advancing self-regulated learning with AI – From measurement to support. Symposium presented at the 21st Biennial Conference of the European Association for Research on Learning and Instruction (EARLI 2025), Graz, Austria, August 25-29, 2025."
    ],
    "otherDissemination": [
        "Järvelä, S., Molenaar, I., de Mooij, S.M.M. (2022, Sept). Giving children agency in an era of artificial intelligence, Bold.expert, https://bold.expert/giving-children-agency-in-an-era-of-artificial-intelligence/",
        "Aksela, O., Athavale, S., Bistolfi, I., Kaarlela, M. (2024, Dec). Can we embrace generative AI in education?, Bold.expert, https://boldscience.org/can-we-embrace-generative-ai-in-education/",
        "Gasevic, D. (2024). New study outlines top GenAI considerations for teachers. The Educator Australia, https://www.theeducatoronline.com/k12/news/new-study-outlines-top-genai-considerations-for-teachers/285919"
    ]
}
